
#ا ل dirctory ده ال folder الي بعمله في النظام 

# علشان ادخل علي فولدرمعين بعمل "cd + اسم الفولدر"

# علشن ارجع خطوه لورابكتب "cd .."

# لو انا عاوز اطلع بره خالص بعمل "cd \"

# لو عاوز اعمل فولدر جديد بكتب "md + name"or "mkdir+name"


# لو عاوز اعمل clear في ال wendos بكتب "cls"

# لو عاوز اعمل كذا فولدر مع بعض بكتب "mkdir + name of folders"

# لو عاوز اعرف ال files الي موجوده في ال folders بكتب "ls or dir "

# لو عاوز اعمل فولدر مكون من اسمين بكتب mkdir + الاسم بس محطوط بين علامات اقتباس

#لو انا عاوز اعمل فايل جوه فولدر وانا موجود في فايل مغين بكتب "mkdir ..\ + name of new name"

# bash بيحول ال wendows 



# لو انا عاوز ادخل file جوه folder "mv +name of file +name of folder "
#لو عاوز اغير اسم  الفولدر بكتب "mv + old_name +new_name (or) rename old_name +new_name"



#لو عاوز اخد copy من folder "cp + -r + old_name + new_name"

# ال SHELL ده المترجم بتاع ال COMMEND

#ال TERMINAL ده اي حاجه بيتكتب فيها ال الاوامر زي POWERSHELL

# ال  POWERSHELL زي ال CMD بس فيه امكاننيات اكتر

#لو عاوز اجيب ال path الي انا وقف فيه بكتب "pwd "

#لو عاوز افتح file بكتب "call + name of file"

# لو عاوز اعر ف ال vercion بتاع الجهاز بكتب "ver"

# لو عاوز اعرف كل المعلومات عن الجهاز بكتب "systeminfo"


#لو عاوز اغير اسم ال file بكتب "ren + old name + new name" 
#او حتي ممكن اغير المتداد بنفس الطريقه




# لو عندي file و عاوز اكتب جواه  حاجات بكتب "echo + الكلام الي انا عاوز اكتبه + > + name of file"
#لو عاوز اعدل علي الفايل بكتب "echo + الكلام الي انا عاوز اكتبه + >.+ name of file"
#لو عاوز انشأ فايل بكتب "echo + .> +name of file"



#لو عاوز اعمل variable في ال terminal بكتب "str + name of variable + = + ال path من علي الحهاز"
#ex)_ str chrome = "ال path"

#لو انا عاوز اعمل ملف المتداد بتالعه بايثون مثلا واكتب جاوه حاجه وتظهرلي في ال تيرمينال "type + naem"


# لو انا عاوز اشفر الفايل بكتب "cipher + /e + file name .extention"
# لو انا عاوز الغي تشفير الفايل بكتب "cipher + /d + file name .extention"


#كيرنر ده الي بيربط بين الهاردوير و السوفتوير

#اي حاجه بعد كلمة "sudo + اي حاجه بعد"

#لو عاوز ابقي انا ال rote بكتب "sudo su""خاص ب لينكس"


#لو عاوز اعرف كل البروسسات الي شغاله ومكانها فين بكتب "ps aux"

####################################  main commends ####################################################
####################################  main commends ####################################################
####################################  main commends ####################################################

#if i want know all file and headen_file in folder can write "la -a"

#لو عندي فولدر جواه فايلات وفولدرات وعاوز اول معل لسيت اعرف افرق بنهم بكتب "ls -alF"
#لو من غير "/"يبقي فايل لو بيها يبقي فولدر

#لو عاوز اعرف ال commend جه منين اكتب "type -a + commend"

#path in windows use back_slash but in linux use floward_slash


# لو عاوز اعرف تفاصيل عن commend معين بكتب "man + commend" ولو عاوز اخرج منه بكتب "q"


#  "bg" Move jobs or execitable file to the background .

# لو عاوز اعرف اسم اليوبونتو بكتب "whoami"
# لو عاوز اعرف اسم الماكنه الي انا فتحاها بكتب "hostname"

# اطبع كلمه بكتب "echo + "statements""

# لمرفت جميع الكوكاندات الي انا جربتها بكتب "history"

# لو عاوز اعرف ال ip بكتب "ip address or ip a"

#لانشاء file بكتب "touch + name file" او لتعديل الملف ولمعرفت اخر ميعاد لنعديل الملف

#لو الفولدر فاضي وعاوز امسحه بكتب "rmdir" ولو مليان بستعمل "rm -r"

# لو عاوز اعمل concatination في الفايل بكتب "cat + name file"

# لو  عاوز ابق root اكتب "sudo + الي انا عاوز اعمله"

# لو عاوز اعرف ال commend موجود فين في النظام بكتب "which + commend"

################################# text files #############################################################
################################# text files #############################################################
################################# text files #############################################################




# لو انا عاوز انقل فايل من مكان لمكن لازم اجيب المكان الي انا عاوز انقل فيه وبعد كده اكتب "cp + اسم الفايل + ""."

# لوعاوز ادخل علشان اعدل في الفايل بكتب "vi + name of file"
# ولو عاوز طلع بكتب ": q"

#لو نا عاوز اعمل save للتعديلات في الفايل بعمل ":w"

# لو  انا عاوز استعمل commend في ال مود بتاع ال vi بكتب ". + : + ! + commend"

#in linux all file is text file

# لو عاوز تيكست اديتور تاني اسهل بكتب "nano"

# if i want excute any commend in text editor "ctrl + t"
#لو عاوز اعمل save بكتب "ctrl + x"

# لو عاوز اعرف ال SHELL الي شغاله بكتب "echo +$SHELL"





############################TERMINAL VS SHELL###############################
############################TERMINAL VS SHELL###############################
############################TERMINAL VS SHELL###############################


# لو عاوز اعرف ال SHELL الي شغاله بكتب "echo +$SHELL"
#لو عاوز انقل من SHELL للتانيه بكتب "chsh"

# لو عاوز اعرف ال shells الي موجوده عندي بكتب "ls /bin/*sh"
#للرجوع للshell القديمه بكتب "sh"

# لو انا عاوز اعمل عدد كبير من الفايلات بكتب "touch file{start_num..end_num}"



##################################pipes,filter,redirection#########################################
##################################pipes,filter,redirection#########################################
##################################pipes,filter,redirection#########################################









